In [ ]:
!git clone https://github.com/adityachoudary54/iotDatasets

Cloning into 'iotDatasets'...
remote: Enumerating objects: 83, done.
remote: Total 83 (delta 0), reused 0 (delta 0), pack-reused 83
Unpacking objects: 100% (83/83), done.
Checking out files: 100% (58/58), done.

In [ ]:
!unzip /content/iotDatasets/Major_Ions_csv.zip

Archive:  /content/iotDatasets/Major_Ions_csv.zip
  inflating: Major_Ions.csv

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv("/content/Major_Ions.csv")

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (2,5,9,13,20,21,28,29,31,32,52,53,56,58,59,62,67,68,76,77,80,82,83,88,89,92,107,109,110,112,113,118,119,121,122,124,125,127,128,130,131,133,134,136,137,140,142,143,145,146,148,149,151,152,155,161,166,170,172,173,177,179,180,182,183,185,186,191,192) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [ ]:
df[['SC_uScm','Cl_mgL','Na_mgL','HCO3_mgl','model_SAR']].head()

   SC_uScm  Cl_mgL  Na_mgL  HCO3_mgl  model_SAR
0   1300.0   210.0   120.0       NaN     0.0901
1   2500.0   620.0   450.0      98.0     0.4040
2    390.0    15.0    58.0       NaN     0.1004
3   3000.0   390.0   520.0       NaN     0.3748
4    870.0   110.0   180.0     150.0     0.6248

In [ ]:
df[['SC_uScm','Cl_mgL','Na_mgL','HCO3_mgl','model_SAR','Ca_mgL','Mg_mgL']].head()

   SC_uScm  Cl_mgL  Na_mgL  HCO3_mgl  model_SAR  Ca_mgL  Mg_mgL
0   1300.0   210.0   120.0       NaN     0.0901   110.0    15.0
1   2500.0   620.0   450.0      98.0     0.4040    86.0     5.0
2    390.0    15.0    58.0       NaN     0.1004    23.0     1.4
3   3000.0   390.0   520.0       NaN     0.3748   110.0    22.0
4    870.0   110.0   180.0     150.0     0.6248     3.0     2.0

In [ ]:
#paramaeters we need
#EC #TDS #SAR #Boron, #Bicarbonate #Sodium #Magnesium #Calcium #Nitrate Nitrogen
#Iron Bicarbonate #chloride
#Conver mg/l to mmol/L dividing values with molar mass

In [ ]:
Na,Ca,Mg=120.0/23, 110/40, 15/24
Na/(Ca+Mg)**(0.5)

2.8399881075746993

In [ ]:
# Na,Ca,Mg=120.0/23, 110/40, 15/24
Na,Ca,Mg=450.0/23, 86/40, 5/24

In [ ]:
Na/(Ca+Mg)**(0.5)

12.740371239588875

In [ ]:
new_df = df
new_df['model_SAR'] = ((new_df['Na_mgL']/23)/((new_df['Ca_mgL']/40)+(new_df['Mg_mgL']/24))**0.5)

In [ ]:
new_df[['SC_uScm','Cl_mgL','Na_mgL','HCO3_mgl','model_SAR','Ca_mgL','Mg_mgL']].head()

   SC_uScm  Cl_mgL  Na_mgL  HCO3_mgl  model_SAR  Ca_mgL  Mg_mgL
0   1300.0   210.0   120.0       NaN   2.839988   110.0    15.0
1   2500.0   620.0   450.0      98.0  12.740371    86.0     5.0
2    390.0    15.0    58.0       NaN   3.168721    23.0     1.4
3   3000.0   390.0   520.0       NaN  11.807006   110.0    22.0
4    870.0   110.0   180.0     150.0  19.667923     3.0     2.0

In [ ]:
new_df = new_df[['SC_uScm','Cl_mgL','Na_mgL','HCO3_mgl','model_SAR','Ca_mgL','Mg_mgL']]

In [ ]:
new_df['HCO3_mgl'].isnull().sum().sum()

53618

In [ ]:
new_df = new_df.dropna()
new_df.describe()

             SC_uScm         Cl_mgL  ...        Ca_mgL        Mg_mgL
count   66613.000000   66613.000000  ...  66613.000000  66613.000000
mean     1357.250536     204.251665  ...     69.220214     26.870587
std      4518.059411    2525.823604  ...    190.359309    102.362717
min        10.000000       0.050000  ...      0.010000      0.004000
25%       380.000000       6.500000  ...     16.020000      3.600000
50%       666.000000      19.000000  ...     40.000000     10.690000
75%      1340.000000      69.100000  ...     80.400000     26.700000
max    241000.000000  194000.000000  ...  27700.000000   9550.000000

[8 rows x 7 columns]

In [ ]:
new_df = new_df.reset_index(drop=True)
new_df.head()

   SC_uScm  Cl_mgL  Na_mgL  HCO3_mgl  model_SAR  Ca_mgL  Mg_mgL
0   2500.0   620.0   450.0      98.0  12.740371    86.0     5.0
1    870.0   110.0   180.0     150.0  19.667923     3.0     2.0
2   1600.0   220.0   350.0     190.0  18.935640    13.0     7.7
3   1700.0   270.0   330.0     210.0  12.543736    29.0    14.0
4   3200.0   590.0   440.0     250.0   7.809967   120.0    72.0

In [ ]:
new_df['Cl_mmol'] = new_df['Cl_mgL']/35.5
new_df['Na_mmol'] = new_df['Na_mgL']/23
new_df['HCO3_mmol'] = new_df['HCO3_mgl']/61
new_df['Ca_mmol'] = new_df['Ca_mgL']/40
new_df['Mg_mmol'] = new_df['Mg_mgL']/24

In [ ]:
new_df.head()

   SC_uScm  Cl_mgL  Na_mgL  HCO3_mgl  ...  HCO3_mmol  Ca_mmol   Mg_mmol  SC_dSm
0   2500.0   620.0   450.0      98.0  ...   1.606557    2.150  0.208333    2.50
1    870.0   110.0   180.0     150.0  ...   2.459016    0.075  0.083333    0.87
2   1600.0   220.0   350.0     190.0  ...   3.114754    0.325  0.320833    1.60
3   1700.0   270.0   330.0     210.0  ...   3.442623    0.725  0.583333    1.70
4   3200.0   590.0   440.0     250.0  ...   4.098361    3.000  3.000000    3.20

[5 rows x 13 columns]

In [ ]:
new_df['SC_dSm'] = new_df['SC_uScm']/1000

In [ ]:
new_features = ['Cl_mmol','Na_mmol','HCO3_mmol','Ca_mmol','Mg_mmol','model_SAR','SC_uScm']

In [ ]:
new_df.describe()

             SC_uScm         Cl_mgL  ...       Mg_mmol        SC_dSm
count   66613.000000   66613.000000  ...  66613.000000  66613.000000
mean     1357.250536     204.251665  ...      1.119608      1.357251
std      4518.059411    2525.823604  ...      4.265113      4.518059
min        10.000000       0.050000  ...      0.000167      0.010000
25%       380.000000       6.500000  ...      0.150000      0.380000
50%       666.000000      19.000000  ...      0.445417      0.666000
75%      1340.000000      69.100000  ...      1.112500      1.340000
max    241000.000000  194000.000000  ...    397.916667    241.000000

[8 rows x 13 columns]

In [ ]:
new_df.to_csv('wqi_imp_badeWala.csv')